# Install Homebrew Bundle and all the packages listed in this Brewfile
#
#   brew tap homebrew/bundle
#   brew bundle
#
# @see https://robots.thoughtbot.com/brewfile-a-gemfile-but-for-homebrew More details

brew "aria2"
brew "wget"
brew "curl"
brew "the_silver_searcher"
brew "hub"
brew "tree"
brew "mas"
brew "zsh"
brew "git"
brew "z"
brew "imagemagick"
brew "gpg"
brew "vim"
brew "httpie"
# Install ThoughtBot's rc dotfile manager
tap "thoughtbot/formulae"
brew "rcm"
# Install PostgreSQL 9.1
tap "petere/homebrew-postgresql"
brew "postgresql-9.1"
# Install Redis 2.4
# tap "nisanth074/SupportBee-homebrew-tap", "https://gitlab.com/nisanth074/SupportBee-homebrew-tap"
# brew "redis24"
brew "memcached"
brew "geckodriver"
brew "chromedriver"
brew "libxml2"
brew "icu4c"
brew "graphviz"
brew "dos2unix"
brew "coreutils" # Install coreutils for the realpath command
brew "mackup"
brew "rcm"
brew "readline"
brew "colordiff"
brew "wifi-password"
cask "osxfuse" # Required for sshfs
brew "sshfs"

# mas "MenuTab for Facebook", id: 421358730
mas "Kindle", id: 405399194
mas "The Unarchiver", id: 425424353
mas "Twitter", id: 409789998
mas "Xcode", id: 497799835
mas "Skitch", id: 425955336
mas "VisualDiff", id: 434097068
mas "Wunderlist", id: 410628904
mas "Unibox", id: 702816521
mas "Slack", id: 803453959
mas "Antetype Viewer", id: 824152298
mas "HazeOver", id: 430798174
mas "Dash", id: 458034879
mas "Wallcat", id: 1000397973
mas "Polymail", id: 1134717305
mas "Newton", id: 1059655371
mas "App Cleaner", id: 1013897218
mas "Simplenote", id: 692867256

cask "google-chrome"
tap "caskroom/homebrew-versions"
cask "google-chrome-canary"
cask "vlc"
cask "iterm2"
cask "flowdock"
cask "popcorn-time"
cask "sourcetree"
cask "itsycal"
cask "skype"
cask "dropbox"
cask "sublime-text"
cask "firefox"
cask "franz"
cask "lepton"
cask "authy"
# cask "atom", { args: { appdir: "/Applications" } }
tap "caskroom/versions"
cask "java7" # Required for elasticsearch

# Fonts
tap "caskroom/fonts"
cask "font-ubuntu"
cask "font-hack"
cask "font-roboto"
cask "font-fira-mono"
cask "font-source-sans-pro"
cask "font-hack"
