# Install Homebrew Bundle and all the packages listed in this Brewfile
#
#   brew tap homebrew/bundle
#   brew bundle
#
# @see https://robots.thoughtbot.com/brewfile-a-gemfile-but-for-homebrew More details

brew "orbstack"
brew "tableplus"
brew "wget"
brew "curl"
brew "the_silver_searcher"
brew "hub"
brew "tree"
brew "mas"
brew "zsh"
brew "zplug"
brew "git"
brew "z"
brew "imagemagick"
brew "gpg"
brew "vim"
brew "httpie"
brew "graphviz"
brew "dos2unix"
brew "coreutils" # Install coreutils for the realpath command
brew "mackup"
brew "readline"
brew "colordiff"
brew "wifi-password"
# cask "osxfuse" # Required for sshfs
# brew "sshfs"
brew "ghostscript" # Required for https://github.com/jakepetroules/littlebirdy
brew "htop"
brew "awscli"
brew "tmux"
mas "WhatsApp", id: 310633997
mas "Telegram", id: 747648890
mas "Simplenote", id: 692867256
mas "Kindle", id: 405399194
mas "The Unarchiver", id: 425424353
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
# mas "Xcode", id: 497799835
# mas "Dash", id: 458034879
mas "Wallcat", id: 1000397973
# mas "HazeOver", id: 430798174
# mas "Unibox", id: 702816521
# mas "Polymail", id: 1134717305
# mas "Newton", id: 1059655371
# mas "MenuTab for Facebook", id: 421358730
# mas "App Cleaner", id: 1013897218
cask "visual-studio-code"
cask "kiro"
cask "cursor"
cask "windsurf"
cask "antigravity"
cask "google-chrome"
cask "logi-options+"
cask "vlc"
cask "iterm2"
cask "fork"
cask "itsycal"
# cask "dropbox"
# cask "sublime-text"
cask "firefox"
# cask "franz"
# cask "lepton"
# cask "cumulus"
cask "google-drive"
cask "scroll-reverser"
cask "webtorrent"
cask "meld"

# Fonts
tap "homebrew/cask-fonts"
cask "font-ubuntu"
# cask "font-hack"
# cask "font-fira-mono"
cask "font-ubuntu-mono"
